In [1]:
import pandas as pd
import numpy as np

In [5]:
dict1={'Name':['ramesh','suresh','satish',np.nan],
      'Age':[30,33,np.nan,36],
       'City':[np.nan,'Hyd','Vizag','Vjd']}

In [7]:
data=pd.DataFrame(dict1)
data

     Name   Age   City
0  ramesh  30.0    NaN
1  suresh  33.0    Hyd
2  satish   NaN  Vizag
3     NaN  36.0    Vjd

In [9]:
data.to_csv('data1.csv')

In [11]:
data.isnull()

    Name    Age   City
0  False  False   True
1  False  False  False
2  False   True  False
3   True  False  False

In [13]:
data.isnull().sum()

Name    1
Age     1
City    1
dtype: int64

**dropna**

   - drop the null values data based on rows and columns

In [17]:
data.dropna()

     Name   Age City
1  suresh  33.0  Hyd

In [19]:
data.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [63]:
dict1={'Name':['ramesh','suresh','satish',np.nan],
      'Age':[30,33,np.nan,36],
       'City':[np.nan,'Hyd','Vizag','Vjd'],
      'Company':['infosis',np.nan,'tcs','wipro']}
data1=pd.DataFrame(dict1)
data1

     Name   Age   City  Company
0  ramesh  30.0    NaN  infosis
1  suresh  33.0    Hyd      NaN
2  satish   NaN  Vizag      tcs
3     NaN  36.0    Vjd    wipro

In [49]:
data1.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

**Fillna**

In [51]:
data1.fillna(30)

     Name   Age   City  Company
0  ramesh  30.0     30  infosis
1  suresh  33.0    Hyd       30
2  satish  30.0  Vizag      tcs
3      30  36.0    Vjd    wipro

In [53]:
data1['Name'].fillna('mamesh')

0    ramesh
1    suresh
2    satish
3    mamesh
Name: Name, dtype: object

**Draw Back : Filling with random value is not a good practice**

- to avoid the we have some methods

- backfill

- bfill

- ffill

- pad

In [65]:
import warnings
warnings.filterwarnings('ignore')
data1.backfill()

     Name   Age   City  Company
0  ramesh  30.0    Hyd  infosis
1  suresh  33.0    Hyd      tcs
2  satish  36.0  Vizag      tcs
3     NaN  36.0    Vjd    wipro

In [69]:
data1.fillna(method='pad')

     Name   Age   City  Company
0  ramesh  30.0    NaN  infosis
1  suresh  33.0    Hyd  infosis
2  satish  33.0  Vizag      tcs
3  satish  36.0    Vjd    wipro

In [71]:
data1.fillna(method='pad',axis=1)

     Name     Age   City  Company
0  ramesh    30.0   30.0  infosis
1  suresh    33.0    Hyd      Hyd
2  satish  satish  Vizag      tcs
3     NaN    36.0    Vjd    wipro

In [57]:
data1.bfill()

     Name   Age   City  Company
0  ramesh  30.0    Hyd  infosis
1  suresh  33.0    Hyd      tcs
2  satish  36.0  Vizag      tcs
3     NaN  36.0    Vjd    wipro

In [59]:
data1.ffill()

     Name   Age   City  Company
0  ramesh  30.0    NaN  infosis
1  suresh  33.0    Hyd  infosis
2  satish  33.0  Vizag      tcs
3  satish  36.0    Vjd    wipro

In [67]:
data1.pad()

     Name   Age   City  Company
0  ramesh  30.0    NaN  infosis
1  suresh  33.0    Hyd  infosis
2  satish  33.0  Vizag      tcs
3  satish  36.0    Vjd    wipro

**Mean-Median-Mode**

In [86]:
age_mean=data1['Age'].mean()
print('age_mean:',age_mean)
data1['Age'].fillna(age_mean)

age_mean: 33.0

0    30.0
1    33.0
2    33.0
3    36.0
Name: Age, dtype: float64

In [88]:
age_median=data1['Age'].median()
print('age_median:',age_median)
data1['Age'].fillna(age_median)

age_median: 33.0

0    30.0
1    33.0
2    33.0
3    36.0
Name: Age, dtype: float64

In [90]:
city_mode=data1['City'].mode()
print('city_mode:',city_mode)
data1['City'].fillna(city_mode)

city_mode: 0      Hyd
1    Vizag
2      Vjd
Name: City, dtype: object

0      Hyd
1      Hyd
2    Vizag
3      Vjd
Name: City, dtype: object

In [106]:
city_mode=data1['City'].mode()
city_mode1=city_mode.values[0]
data1['City'].fillna(city_mode1)

0      Hyd
1      Hyd
2    Vizag
3      Vjd
Name: City, dtype: object

**KNN Imputer**

In [111]:
from sklearn import impute
dir(impute)

['KNNImputer',
 'MissingIndicator',
 'SimpleImputer',
 '__all__',
 '__builtins__',
 '__cached__',
 '__doc__',
 '__file__',
 '__getattr__',
 '__loader__',
 '__name__',
 '__package__',
 '__path__',
 '__spec__',
 '_base',
 '_knn',
 'typing']

In [113]:
import numpy as np
from sklearn.impute import KNNImputer
x=[[1,2,np.nan],[3,np.nan,3],[np.nan,60,5],[8,8,7]]
imputer=KNNImputer(n_neighbors=2,weights='uniform')
imputer.fit_transform(x)

array([[ 1. ,  2. ,  5. ],
       [ 3. , 31. ,  3. ],
       [ 5.5, 60. ,  5. ],
       [ 8. ,  8. ,  7. ]])

In [115]:
import numpy as np
from sklearn.impute import KNNImputer
x=[[1,2,np.nan],[3,np.nan,3],[np.nan,60,5],[8,8,7]]
imputer=KNNImputer(n_neighbors=2,weights='distance')
imputer.fit_transform(x)

array([[ 1.        ,  2.        ,  3.93905505],
       [ 3.        , 31.        ,  3.        ],
       [ 3.25775362, 60.        ,  5.        ],
       [ 8.        ,  8.        ,  7.        ]])